a = input()
counts = {"Рене Сюлли-Прюдом": "1901", "Теодор Моммзен": "1902",
          "Бьернстерне Мартиниус Бьернсон": "1903",
          "Хосе Мария Вальдо Эчегарай - И - Эйсагирре": "1904",
          "Фредерик Мистраль": "1904", "Генрик Сенкевич": "1905", "Джозуэ Кардуччи": "1906",
          "Джозеф Редьярд Киплинг": "1907", "Рудольф Кристоф Эйкен": "1908",
          "Сельма Лагерлеф": "1909", "Пауль Йоханн Людвиг фон Хейзе": "1910",
          "Морис Метерлинк": "1911", "Герхардт Гауптман": "1912",
          "Рабиндранат Тагор": "1913", "Ромен Роллан": "1915",
          "Карл Густав Вернер фон Хейденстам": "1916",
          "Хенрик Понтоппидан": "1917", "Карл Адольф Гьеллеруп": "1917",
          "Карл Фридрих Георг Шпиттелер": "1919", "Кнут Гамсун": "1920", "Анатоль Франс": "1921",
          "Хасинто Бенавенте - И - Мартинес": "1922", "Уильям Батлер Йитс": "1923",
          "Владислав Станислав Реймонт": "1924", "Джордж Бернард Шоу": "1925",
          "Грация Деледда": "1926", "Анри Бергсон": "1927", "Сигрид Унсет": "1928",
          "Томас Манн": "1929", "Синклер Льюис": "1930", "Эрик Карлфельдт": "1931",
          "Джон Голсуорси": "1932", "Иван Алексеевич Бунин": "1933", "Луиджи Пиранделло": "1934",
          "Юджин ОНил": "1936", "Роже Мартен Дю Гар": "1937", "Перл Бак": "1938",
          "Франс Эмиль Силланпя": "1939", "Йоханнес Йенсен": "1944", "Габриела Мистраль": "1945",
          "Герман Гессе": "1946", "Андре Жид": "1947", "Томас Стернз Элиот": "1948",
          "Уильям Фолкнер": "1949", "Бертран Рассел": "1950", "Пер Фабиан Лагерквист": "1951",
          "Франсуа Мориак": "1952", "Уинстон Леонард Спенсер Черчилль": "1953",
          "Эрнест Миллер Хемингуэй": "1954", "Хальдоур Кильян Лакснесс": "1955",
          "Хуан Рамон Хименес": "1956", "Альбер Камю": "1957", "Борис Леонидович Пастернак": "1958",
          "Сальваторе Квазимодо": "1959", "Сен-Жон Перс": "1960", "Иво Андрич": "1961",
          "Джон Стейнбек": "1962", "Георгос Сеферис": "1963", "Жан-Поль Сартр": "1964",
          "Михаил Александрович Шолохов": "1965", "Нелли Закс": "1966",
          "Шмуэль Йозеф Агнон": "1966", "Мигель Астуриас": "1967",
          "Ясунари Кавабата": "1968", "Сэмюэл Беккет": "1969",
          "Александр Исаевич Солженицын": "1970", "Пабло Неруда": "1971", "Генрих Белль": "1972",
          "Патрик Виктор Мартиндейл Уайт": "1973", "Харри Мартинсон": "1974", "Эйвинд Йонсон":
          "1974", "Эудженио Монтале": "1975", "Сол Беллоу": "1976", "Висенте Алейксандре":
          "1977", "Исаак Башевис Зингер": "1978", "Одисеас Элитис": "1979",
          "Чеслав Милош": "1980", "Элиас Канетти": "1981", "Габриэль Гарсия Маркес":
          "1982", "Уильям Голдинг": "1983", "Ярослав Сейферт": "1984", "Клод Симон":
          "1985", "Воле Шойинка": "1986", "Иосиф Бродский": "1987", "Нагиб Махфуз":
          "1988", "Камило Хосе Села": "1989", "Октавио Пас": "1990", "Надин Гордимер": "1991",
          "Дерек Уолкотт": "1992", 'Тони Моррисон': "1993",
          "Кэнзабуро Оэ": "1994", "Шеймус Хини": "1995", "Вислава Шимборска": "1996",
          "Дарио Фо": "1997", "Жозе Сарамаго": "1998", "Гюнтер Грасс": "1999", "Гао Синцзянь":
          "2000", "Видиадхар Сураджпрасад Найпол": "2001", "Имре Кертес": "2002",
          "Джон Максвелл Кутзее": "2003", "Эльфрида Елинек": "2004", "Гарольд Пинтер": "2005",
          "Орхан Памук": "2006", "Дорис Лессинг": "2007", "Жан-Мари Гюстав Леклезио": "2008",
          "Герта Мюллер": "2009", "Марио Варгас Льоса": "2010", "Тумас Транстремер": "2011",
          "Мо Янь": "2012", "Элис Энн Манро": "2013", "Патрик Модиано": "2014",
          "Светлана Алексиевич": "2015", "Боб Дилан": "2016", "Кадзуо Исигуро": "2017",
          "Ольга Токарчук": "2018", "Петер Хандке": "2019", "Луиза Глюк": "2020"
          }
print(counts.get(a))
